project/atropos-go/etcd_concurrent_read-master/master/e2/output/without_expensive_read/cheap_read.log
bench with linearizable range
 0 / 1000 B                                                                                                                                           !   0.00%INFO: 2023/06/09 14:51:24 ccResolverWrapper: sending new addresses to cc: [{localhost:2379 0  <nil>}]
INFO: 2023/06/09 14:51:24 balancerWrapper: got update addr from Notify: [{localhost:2379 <nil>}]
INFO: 2023/06/09 14:51:24 balancerWrapper: got update addr from Notify: [{localhost:2379 <nil>}]
 1000 / 1000 Booooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooo! 100.00% 9s

Summary:
  Total:	9.9911 secs.
  Slowest:	0.0041 secs.
  Fastest:	0.0002 secs.
  Average:	0.0004 secs.
  Stddev:	0.0004 secs.
  Requests/sec:	100.0896

Response time histogram:
  0.0002 [1]	|
  0.0006 [897]	|∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎
  0.0009 [53]	|∎∎
  0.0013 [6]	|
  0.0017 [17]	|
  0.0021 [15]	|
  0.0025 [1]	|
  0.0029 [2]	|
  0.0033 [3]	|
  0.0037 [4]	|
  0.0041 [1]	|

Latency distribution:
  10% in 0.0002 secs.
  25% in 0.0003 secs.
  50% in 0.0003 secs.
  75% in 0.0004 secs.
  90% in 0.0006 secs.
  95% in 0.0009 secs.
  99% in 0.0026 secs.
  99.9% in 0.0041 secs.